<a href="https://colab.research.google.com/github/RKulagowska/Pandas/blob/main/11_Dodatkowe_02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [70]:
df= pd.DataFrame({'s_name':['Jan','Otto', 'Tom', 'John'],'s_surname':['Kowalski','Nowak','Cruise','Next'],'city':['Kraków','Łódź','Lwów','Tarnów'],'price':['9 900 $','2 000 $',' 33 000 $',' 14 500 $']})
print(df)

  s_name s_surname    city      price
0    Jan  Kowalski  Kraków    9 900 $
1   Otto     Nowak    Łódź    2 000 $
2    Tom    Cruise    Lwów   33 000 $
3   John      Next  Tarnów   14 500 $

In [71]:
df['price'] = df['price'].map(lambda x: int(x.split('$')[0].replace(' ','')))
print(df)

  s_name s_surname    city  price
0    Jan  Kowalski  Kraków   9900
1   Otto     Nowak    Łódź   2000
2    Tom    Cruise    Lwów  33000
3   John      Next  Tarnów  14500

In [72]:
df['cur']= '$'
print(df)

  s_name s_surname    city  price cur
0    Jan  Kowalski  Kraków   9900   $
1   Otto     Nowak    Łódź   2000   $
2    Tom    Cruise    Lwów  33000   $
3   John      Next  Tarnów  14500   $

In [69]:
def new(x):
  return int(x.split('$')[0].replace(' ',''))
df['price'].map(new)

0     9900
1     2000
2    33000
3    14500
Name: price, dtype: int64

In [78]:
df['full_name']= df['s_name'] + ' '+df['s_surname']
print(df)

  s_name s_surname    city  price cur     full_name
0    Jan  Kowalski  Kraków   9900   $  Jan Kowalski
1   Otto     Nowak    Łódź   2000   $    Otto Nowak
2    Tom    Cruise    Lwów  33000   $    Tom Cruise
3   John      Next  Tarnów  14500   $     John Next

In [80]:
df['city_num']= df['city'].map(lambda x : x[0]).factorize()[0]
print(df)

  s_name s_surname    city  price cur     full_name  city_num
0    Jan  Kowalski  Kraków   9900   $  Jan Kowalski         0
1   Otto     Nowak    Łódź   2000   $    Otto Nowak         1
2    Tom    Cruise    Lwów  33000   $    Tom Cruise         2
3   John      Next  Tarnów  14500   $     John Next         3

In [82]:
df.city.factorize()

(array([0, 1, 2, 3]),
 Index(['Kraków', 'Łódź', 'Lwów', 'Tarnów'], dtype='object'))

In [84]:
print(df)

  s_name s_surname    city  price cur     full_name  city_num
0    Jan  Kowalski  Kraków   9900   $  Jan Kowalski         0
1   Otto     Nowak    Łódź   2000   $    Otto Nowak         1
2    Tom    Cruise    Lwów  33000   $    Tom Cruise         2
3   John      Next  Tarnów  14500   $     John Next         3

In [98]:
df2= pd.DataFrame({'A':[2,3,4,5],'B':[100,'NaN',300,400],'C':[10000,20000,40000,6000]})
print(df2)

   A    B      C
0  2  100  10000
1  3  NaN  20000
2  4  300  40000
3  5  400   6000

In [102]:
df2.loc[:,df2.notnull().any()]

   A    B      C
0  2  100  10000
1  3  NaN  20000
2  4  300  40000
3  5  400   6000

In [110]:
df2.loc[:,df2.notnull().all()]

   A    B      C
0  2  100  10000
1  3  NaN  20000
2  4  300  40000
3  5  400   6000